cases/VolumeAreaVerification/VolumeAreaVerification2/constant/turbulenceProperties
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"constant";
	object	turbulenceProperties;
}
simulationType	laminar;
